; domain
(define (domain AUV)
(:requirements :typing :equality)
(:types vehicle location resource - object
        auv ship - vehicle
)

(:predicates (at ?v - vehicle ?l - location)
             (connected ?l1 ?l2 - location)
             (at-res ?r - resource ?l - location)
             (sampled ?r - resource)
             (free ?l - location)
             (operational ?a - auv)
             (connected-ship ?s - ship ?l1 ?l2 - location)
             (outside ?s - ship)
             (entry ?s - ship ?l - location)
             (exit ?s - ship ?l - location)
             
             (act-round)
             (dup-free ?l - location)
)

(:action move
:parameters (?a - auv ?l1 ?l2 - location)
:precondition (and (at ?a ?l1)
                   (operational ?a)
                   (connected ?l1 ?l2)
                   (free ?l2)
              )
:effect (and (not (at ?a ?l1))
             (at ?a ?l2)
             (free ?l1)
             (not (free ?l2))
        )
)

(:action sample
:parameters (?a - auv ?r - resource ?l - location)
:precondition (and (at ?a ?l)
                   (at-res ?r ?l)
                   (operational ?a)
              )
:effect (and (sampled ?r)
        )
)



)

; problem
(define (problem AUV-problem)
(:domain AUV)
(:objects a - auv
          s - ship
          r1 r2 r3 - resource
          l-1-1 l-1-2 l-1-3 l-1-4 l-2-1 l-2-2 l-2-3 l-2-4 l-3-1 l-3-2 l-3-3 l-3-4 l-4-1 l-4-2 l-4-3 l-4-4 - location
)

(:init (act-round)
       (operational a)
       (outside s)
       (at a l-1-1)
       (at-res r1 l-2-4)
       (at-res r2 l-4-4)
       (at-res r3 l-4-2)

(free l-1-1)
(free l-1-2)
(free l-1-3)
(free l-1-4)
(free l-2-1)
(free l-2-2)
(free l-2-3)
(free l-2-4)
(free l-3-1)
(free l-3-2)
(free l-3-3)
(free l-3-4)
(free l-4-1)
(free l-4-2)
(free l-4-3)
(free l-4-4)

(dup-free l-1-1)
(dup-free l-1-2)
(dup-free l-1-3)
(dup-free l-1-4)
(dup-free l-2-1)
(dup-free l-2-2)
(dup-free l-2-3)
(dup-free l-2-4)
(dup-free l-3-1)
(dup-free l-3-2)
(dup-free l-3-3)
(dup-free l-3-4)
(dup-free l-4-1)
(dup-free l-4-2)
(dup-free l-4-3)
(dup-free l-4-4)

(connected l-1-1 l-2-1)
(connected l-2-1 l-1-1)
(connected l-1-1 l-1-2)
(connected l-1-2 l-1-1)
(connected l-1-2 l-2-2)
(connected l-2-2 l-1-2)
(connected l-1-2 l-1-3)
(connected l-1-3 l-1-2)
(connected l-1-3 l-2-3)
(connected l-2-3 l-1-3)
(connected l-1-3 l-1-4)
(connected l-1-4 l-1-3)
(connected l-1-4 l-2-4)
(connected l-2-4 l-1-4)
(connected l-2-1 l-3-1)
(connected l-3-1 l-2-1)
(connected l-2-1 l-2-2)
(connected l-2-2 l-2-1)
(connected l-2-2 l-3-2)
(connected l-3-2 l-2-2)
(connected l-2-2 l-2-3)
(connected l-2-3 l-2-2)
(connected l-2-3 l-3-3)
(connected l-3-3 l-2-3)
(connected l-2-3 l-2-4)
(connected l-2-4 l-2-3)
(connected l-2-4 l-3-4)
(connected l-3-4 l-2-4)
(connected l-3-1 l-4-1)
(connected l-4-1 l-3-1)
(connected l-3-1 l-3-2)
(connected l-3-2 l-3-1)
(connected l-3-2 l-4-2)
(connected l-4-2 l-3-2)
(connected l-3-2 l-3-3)
(connected l-3-3 l-3-2)
(connected l-3-3 l-4-3)
(connected l-4-3 l-3-3)
(connected l-3-3 l-3-4)
(connected l-3-4 l-3-3)
(connected l-3-4 l-4-4)
(connected l-4-4 l-3-4)
(connected l-4-1 l-4-2)
(connected l-4-2 l-4-1)
(connected l-4-2 l-4-3)
(connected l-4-3 l-4-2)
(connected l-4-3 l-4-4)
(connected l-4-4 l-4-3)

(entry s l-3-4)
(exit s l-3-1)
(exit s l-4-3)
(connected-ship s l-3-4 l-3-3)
(connected-ship s l-3-3 l-3-2)
(connected-ship s l-3-2 l-3-1)

(connected-ship s l-3-3 l-4-3)

)

(:goal (and (sampled r1)
            (sampled r2)
            (sampled r3)
            (at a l-1-1)
            (operational a)
       )
)

)

; plan
1. (move a l-1-1 l-1-2)
   deleted: (at a l-1-1) (free l-1-2)
   added: (at a l-1-2)
   goals met: 1 of 5
2. (move a l-1-2 l-1-3)
   deleted: (at a l-1-2) (free l-1-3)
   added: (at a l-1-3) (free l-1-2)
   goals met: 1 of 5
3. (move a l-1-3 l-1-4)
   deleted: (at a l-1-3) (free l-1-4)
   added: (at a l-1-4) (free l-1-3)
   goals met: 1 of 5
4. (move a l-1-4 l-2-4)
   deleted: (at a l-1-4) (free l-2-4)
   added: (at a l-2-4) (free l-1-4)
   goals met: 1 of 5
5. (sample a r1 l-2-4)
   added: (sampled r1)
   goals met: 2 of 5
6. (move a l-2-4 l-3-4)
   deleted: (at a l-2-4) (free l-3-4)
   added: (at a l-3-4) (free l-2-4)
   goals met: 2 of 5
7. (move a l-3-4 l-4-4)
   deleted: (at a l-3-4) (free l-4-4)
   added: (at a l-4-4) (free l-3-4)
   goals met: 2 of 5
8. (sample a r2 l-4-4)
   added: (sampled r2)
   goals met: 3 of 5
9. (move a l-4-4 l-4-3)
   deleted: (at a l-4-4) (free l-4-3)
   added: (at a l-4-3) (free l-4-4)
   goals met: 3 of 5
10. (move a l-4-3 l-4-2)
   deleted: (at a l-4-3) (free l-4-2)
   added: (at a l-4-2) (free l-4-3)
   goals met: 3 of 5
11. (sample a r3 l-4-2)
   added: (sampled r3)
   goals met: 4 of 5
12. (move a l-4-2 l-3-2)
   deleted: (at a l-4-2) (free l-3-2)
   added: (at a l-3-2) (free l-4-2)
   goals met: 4 of 5
13. (move a l-3-2 l-2-2)
   deleted: (at a l-3-2) (free l-2-2)
   added: (at a l-2-2) (free l-3-2)
   goals met: 4 of 5
14. (move a l-2-2 l-1-2)
   deleted: (at a l-2-2) (free l-1-2)
   added: (at a l-1-2) (free l-2-2)
   goals met: 4 of 5
15. (move a l-1-2 l-1-1)
   deleted: (at a l-1-2) (free l-1-1)
   added: (at a l-1-1) (free l-1-2)
   goals met: 5 of 5
